{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_3","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":1003}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout9","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":1004}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout10","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":1005}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout11","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":1006}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout12","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":1007}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense11/kernel","shape":[14,128],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}